zpb/frontend/controllers/CreateController.php

    public function actionIndex(){
        // $rows = (new \yii\db\Query())
        // ->select(['*'])
        // ->from('zpb_article_sort')
        // ->limit(5)
        // ->all();
        $type = (new \yii\db\query())->select(['*'])->from('zpb_type')->where(['type_pid'=>0])->all();
        foreach($type as $key=>$v)
        {
            $type[$key]['child']=(new \yii\db\query())->select(['*'])->from('zpb_type')->where(['type_pid'=>$v['type_id']])->all();
            foreach($type[$key]['child'] as $k=>$val)
            {
                $type[$key]['child'][$k]['chilrden']=(new \yii\db\query())->select(['*'])->from('zpb_type')->where(['type_pid'=>$val['type_id']])->all();
            }
        }
        $study = (new \yii\db\query())->select(['*'])->from('zpb_study')->all();
        $suffer = (new \yii\db\query())->select(['*'])->from('zpb_suffer')->all();
---
SELECT * FROM `zpb_type` WHERE `type_pid`=0
SELECT * FROM `zpb_type` WHERE `type_pid`='1'
SELECT * FROM `zpb_type` WHERE `type_pid`='5'
SELECT * FROM `zpb_study`
SELECT * FROM `zpb_suffer`

    public function actionMyhome(){
		$session = Yii::$app->session;
		$m_id = $session['m_id'];
		$row = (new \yii\db\query())->select(['*'])->from('zpb_firm')->where(['m_id'=>$m_id])->one();
		$rows = (new \yii\db\query())->select(['*'])->from('zpb_field')->where(['field_id'=>$row['field_id']])->one();
		$row['field_name'] = $rows['field_name'];
		$firm_xy = $row['firm_xy'];
		$firm_xy = explode(',',$firm_xy);
		$field = (new \yii\db\query())->select(['*'])->from('zpb_field')->all();
---
SELECT * FROM `zpb_firm` WHERE `m_id`='9'
SELECT * FROM `zpb_field` WHERE `field_id` IS NULL
SELECT * FROM `zpb_field`

	public function actionDel_firm_xy()
	{
		$session = Yii::$app->session;
		$m_id = $session['m_id'];
		$db = Yii::$app->db;
		$request = Yii::$app->request->get('a');
		$row = (new \yii\db\query())->select(['firm_xy'])->from('zpb_firm')->innerjoin('zpb_field','zpb_field.field_id=zpb_firm.field_id')->where(['m_id'=>$m_id])->one();
		$firm_xy = $row['firm_xy'];
		$firm_xy = explode(',',$firm_xy);
		$key = array_search($request,$firm_xy);
		if ($key !== false)
		{
			array_splice($firm_xy, $key , 1);
		}
		$xy = implode(',',$firm_xy);
		$res = $db->createCommand()->update('zpb_firm',['firm_xy'=>$xy],'m_id=:id',[':id'=>$m_id])->execute();
---
SELECT `firm_xy` FROM `zpb_firm` INNER JOIN `zpb_field` ON zpb_field.field_id=zpb_firm.field_id WHERE `m_id`='9'
UPDATE `zpb_firm` SET `firm_xy`='' WHERE m_id='9'

	public function actionLabel()
	{
		$session = Yii::$app->session;
		$db = Yii::$app->db;
		$m_id = $session['m_id'];
		$request = Yii::$app->request->get('b');
		$row = (new \yii\db\query())->select(['firm_xy'])->from('zpb_firm')->innerjoin('zpb_field','zpb_field.field_id=zpb_firm.field_id')->where(['m_id'=>$m_id])->one();
		$firm_xy = $row['firm_xy'];
		if(!$firm_xy=='')
		{
			$firm_xy = $firm_xy.','.$request;
		}
		else
		{
			$firm_xy = $firm_xy.','.$request;
			$firm_xy = substr($firm_xy,1);
		}
		$res = $db->createCommand()->update('zpb_firm',['firm_xy'=>$firm_xy],'m_id=:id',[':id'=>$m_id])->execute();
---
SELECT `firm_xy` FROM `zpb_firm` INNER JOIN `zpb_field` ON zpb_field.field_id=zpb_firm.field_id WHERE `m_id`='9'
UPDATE `zpb_firm` SET `firm_xy`='妹子多' WHERE m_id='9'

	public function actionLogo()
	{
		$session = Yii::$app->session;
		$db = Yii::$app->db;
		$m_id = $session['m_id'];
		if(!file_exists($_FILES['upload_file']['name']))
		{
			$path = 'frontend/assets/style/images/logo/';
			if(move_uploaded_file($_FILES['upload_file']['tmp_name'],$path.$_FILES['upload_file']['name']))
			{
				$res = $db->createCommand()->update('zpb_firm',['firm_logo'=>$path.$_FILES['upload_file']['name']],'m_id=:id',[':id'=>$m_id])->execute();
---
UPDATE `zpb_firm` SET `firm_logo`='frontend/assets/style/images/logo/52feaf0048d5b908988cb737.jpg' WHERE m_id='9'

    public function actionInterview(){
        $session = Yii::$app->session;
        $m_id = $session['m_id'];
        $posts =(new \yii\db\query())->select(['*'])->from('zpb_record')->innerjoin('zpb_preson','zpb_preson.m_id=zpb_record.m_id')->innerjoin('zpb_study','zpb_study.stu_id=zpb_preson.stu_id')->innerjoin('zpb_suffer','zpb_suffer.suf_id=zpb_preson.suf_id')->innerjoin('zpb_resume','zpb_resume.m_id=zpb_preson.m_id')->innerjoin('zpb_recruit','zpb_recruit.rec_id=zpb_record.rec_id')->innerjoin('zpb_members','zpb_members.m_id=zpb_record.m_id')->where('zpb_recruit.m_id='.$m_id.' and zpb_record.sta_id=0')->all();
---
SELECT * FROM `zpb_record` INNER JOIN `zpb_preson` ON zpb_preson.m_id=zpb_record.m_id INNER JOIN `zpb_study` ON zpb_study.stu_id=zpb_preson.stu_id INNER JOIN `zpb_suffer` ON zpb_suffer.suf_id=zpb_preson.suf_id INNER JOIN `zpb_resume` ON zpb_resume.m_id=zpb_preson.m_id INNER JOIN `zpb_recruit` ON zpb_recruit.rec_id=zpb_record.rec_id INNER JOIN `zpb_members` ON zpb_members.m_id=zpb_record.m_id WHERE zpb_recruit.m_id=1 and zpb_record.sta_id=0

    public function actionHaverefuse(){
        $session = Yii::$app->session;
        $m_id = $session['m_id'];
        $posts =(new \yii\db\query())->select(['*'])->from('zpb_record')->innerjoin('zpb_preson','zpb_preson.m_id=zpb_record.m_id')->innerjoin('zpb_study','zpb_study.stu_id=zpb_preson.stu_id')->innerjoin('zpb_suffer','zpb_suffer.suf_id=zpb_preson.suf_id')->innerjoin('zpb_resume','zpb_resume.m_id=zpb_preson.m_id')->innerjoin('zpb_recruit','zpb_recruit.rec_id=zpb_record.rec_id')->innerjoin('zpb_members','zpb_members.m_id=zpb_record.m_id')->where('zpb_recruit.m_id='.$m_id.' and zpb_record.sta_id=1')->all();
---
SELECT * FROM `zpb_record` INNER JOIN `zpb_preson` ON zpb_preson.m_id=zpb_record.m_id INNER JOIN `zpb_study` ON zpb_study.stu_id=zpb_preson.stu_id INNER JOIN `zpb_suffer` ON zpb_suffer.suf_id=zpb_preson.suf_id INNER JOIN `zpb_resume` ON zpb_resume.m_id=zpb_preson.m_id INNER JOIN `zpb_recruit` ON zpb_recruit.rec_id=zpb_record.rec_id INNER JOIN `zpb_members` ON zpb_members.m_id=zpb_record.m_id WHERE zpb_recruit.m_id=1 and zpb_resume.sta_id=1

    public function actionNorefuse(){
        $session = Yii::$app->session;
        $m_id = $session['m_id'];
        $posts =(new \yii\db\query())->select(['*'])->from('zpb_record')->innerjoin('zpb_preson','zpb_preson.m_id=zpb_record.m_id')->innerjoin('zpb_study','zpb_study.stu_id=zpb_preson.stu_id')->innerjoin('zpb_suffer','zpb_suffer.suf_id=zpb_preson.suf_id')->innerjoin('zpb_resume','zpb_resume.m_id=zpb_preson.m_id')->innerjoin('zpb_recruit','zpb_recruit.rec_id=zpb_record.rec_id')->innerjoin('zpb_members','zpb_members.m_id=zpb_record.m_id')->where('zpb_recruit.m_id='.$m_id.' and zpb_record.sta_id=2')->all();
---
SELECT * FROM `zpb_record` INNER JOIN `zpb_preson` ON zpb_preson.m_id=zpb_record.m_id INNER JOIN `zpb_study` ON zpb_study.stu_id=zpb_preson.stu_id INNER JOIN `zpb_suffer` ON zpb_suffer.suf_id=zpb_preson.suf_id INNER JOIN `zpb_resume` ON zpb_resume.m_id=zpb_preson.m_id INNER JOIN `zpb_recruit` ON zpb_recruit.rec_id=zpb_record.rec_id INNER JOIN `zpb_members` ON zpb_members.m_id=zpb_record.m_id WHERE zpb_recruit.m_id=1 and zpb_resume.sta_id=2