zpb/frontend/controllers/FirmController.php

INSERT INTO `zpb_firm` (`m_id`, `firm_name`) VALUES (9, '冯强')
---
	public function actionAct2()
	{
		$request = Yii::$app->request;
		$firm_name = $request->post('companyName');
		$session = Yii::$app->session;
		$m_id = $session['m_id'];
		$db = Yii::$app->db;
		$res = $db->createCommand()->insert('zpb_firm',['m_id'=>$m_id,'firm_name'=>$firm_name])->execute();