zpb/frontend/controllers/ResumeController.php

SELECT `pre_name`, `pre_time`, `pre_age`, `pre_sex`, `stu_name`, `suf_name`, `m_phone`, `m_email`, `sta_name`, `pre_head`, `res_hope`, `res_works_undergo`, `res_project_experiences`, `res_study_undergo`, `res_desc`, `res_works` FROM `zpb_preson` `p` LEFT JOIN `zpb_members` `m` ON m.m_id=p.m_id LEFT JOIN `zpb_study` `s` ON s.stu_id = p.stu_id LEFT JOIN `zpb_suffer` `su` ON su.suf_id = p.suf_id LEFT JOIN `zpb_resume` `r` ON r.m_id = p.m_id LEFT JOIN `zpb_status` `st` ON st.sta_id = p.sta_id WHERE `m`.`m_id`=1
SELECT * FROM `zpb_study`
SELECT * FROM `zpb_suffer`
SELECT * FROM `zpb_status`
---
    public function actionIndex()
    {
        $session = Yii::$app->session;
          //模拟session
        $m_id=$session->get('m_id');  //取出个人用户登录的id

        $query = (new \yii\db\Query())
            ->select('pre_name,pre_time,pre_age,pre_sex,stu_name,suf_name,m_phone,m_email,sta_name,pre_head,res_hope,res_works_undergo,res_project_experiences,res_study_undergo,res_desc,res_works')
            ->from('zpb_preson AS p')
            ->leftJoin('zpb_members AS m','m.m_id=p.m_id')
            ->leftJoin('zpb_study AS s','s.stu_id = p.stu_id')
            ->leftJoin('zpb_suffer AS su','su.suf_id = p.suf_id')
            ->leftJoin('zpb_resume AS r','r.m_id = p.m_id')
            ->leftJoin('zpb_status AS st','st.sta_id = p.sta_id')
            ->where(['m.m_id'=>$m_id])
            ->One();
        //反序列化取出期望工作
        $query['res_hope']=unserialize($query['res_hope']);
        //反序列化取出工作经历
        $query['res_works_undergo']=unserialize($query['res_works_undergo']);
        //反序列化取出项目经验
        $query['res_project_experiences']=unserialize($query['res_project_experiences']);
        //反序列化取出教育经历
        $query['res_study_undergo']=unserialize($query['res_study_undergo']);
        //反序列化取出个人作品
        $query['res_works']=unserialize($query['res_works']);
        //查询学历
        $study = (new \yii\db\Query())
            ->select('*')
            ->from('zpb_study')
            ->all();
        //查询工作经验
        $suffer = (new \yii\db\Query())
            ->select('*')
            ->from('zpb_suffer')
            ->all();
        //目前状态
        $status = (new \yii\db\Query())
            ->select('*')
            ->from('zpb_status')
            ->all();

SELECT * FROM `zpb_collect` INNER JOIN `zpb_recruit` ON zpb_recruit.rec_id=zpb_collect.rec_id INNER JOIN `zpb_firm` ON zpb_firm.m_id=zpb_recruit.m_id INNER JOIN `zpb_study` ON zpb_study.stu_id=zpb_recruit.stu_id INNER JOIN `zpb_suffer` ON zpb_suffer.suf_id=zpb_recruit.suf_id WHERE zpb_collect.m_id=2
---
    public function actionCollections()
    {
		$session = Yii::$app->session;
		$m_id = $session->get('m_id');
		$data = (new \yii\db\query())->select(['*'])->from('zpb_collect')->innerjoin('zpb_recruit','zpb_recruit.rec_id=zpb_collect.rec_id')->innerjoin('zpb_firm','zpb_firm.m_id=zpb_recruit.m_id')->innerjoin('zpb_study','zpb_study.stu_id=zpb_recruit.stu_id')->innerjoin('zpb_suffer','zpb_suffer.suf_id=zpb_recruit.suf_id')->where('zpb_collect.m_id='.$m_id)->all();