zpb/frontend/controllers/SiteController.php

SELECT * FROM `zpb_article_sort` LIMIT 5
SELECT * FROM `zpb_type` WHERE `type_pid`='1'
SELECT * FROM `zpb_type` WHERE `type_pid`='5'
---
    public function actionIndex(){
        $rows = (new \yii\db\Query())
            ->select(['*'])
            ->from('zpb_article_sort')
            ->limit(5)
            ->all();
        $type = (new \yii\db\query())->select(['*'])->from('zpb_type')->where(['type_pid'=>0])->all();
        foreach($type as $key=>$v)
        {
            $type[$key]['child']=(new \yii\db\query())->select(['*'])->from('zpb_type')->where(['type_pid'=>$v['type_id']])->all();
            foreach($type[$key]['child'] as $k=>$val)
            {
                $type[$key]['child'][$k]['chilrden']=(new \yii\db\query())->select(['*'])->from('zpb_type')->where(['type_pid'=>$val['type_id']])->all();